---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CouplerCode
source: html/996aa31c-51b9-7f42-77c1-1bfd25c70421.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CouplerCode Property

"Part Number"

## Syntax (C#)
```csharp
public static ForgeTypeId CouplerCode { get; }
```